---
kind: method
id: M:Autodesk.Revit.DB.Structure.LoadCombination.GetUsageIds
source: html/f39b9703-4c1b-5188-0cba-eeaf04003b4e.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination.GetUsageIds Method

Returns collection of the load combination usage IDs.

## Syntax (C#)
```csharp
public IList<ElementId> GetUsageIds()
```

## Returns
A collection of the load combination usage IDs.